# Missing Data

Part of preprocessing

In [33]:
import numpy as np
import pandas as pd

#### 4 types of data: nominal, ordeal, numeric, categoric

In [34]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})#data frame from dictionary

In [35]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [36]:
'abc'.split()

['abc']

In [37]:
'a.b.c'.split()

['a.b.c']

In [38]:
'a.b.c'.split('.')

['a', 'b', 'c']

### If we have nan value we cannot proceed further for analysis. we need to reprocess
### easisest: delete. but only value is not deleted, row/col also deleted. data loss
### Dealing with missing data: data reprocessing
### change value: to similar value
### but if we have lots of data, this also fails
### mean median mode come in
### mean: problem is outlier, only numeric values
### boxplot to visualize and find outlier
### if outlier exists, go with median not mean, also only numeric values
### mode, categorical data, freq of occurrence
### check percentage of missing data. if >50% then delete it.

In [39]:
df.dropna()#shows drawback of delete

     A    B  C
0  1.0  5.0  1

In [40]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [41]:
df.dropna(axis=1)#columnwise deletion

   C
0  1
1  2
2  3

In [42]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [43]:
df.dropna(thresh=2)#thresh stands for threshold,i.e 2 nan values, so thresh means <= value

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [44]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [45]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [46]:
df.fillna(value="Fillvalue")# still useless

           A          B  C
0        1.0        5.0  1
1        2.0  Fillvalue  2
2  Fillvalue  Fillvalue  3

In [47]:
df['A'].fillna(value=df['A'].mean())#mean method

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [48]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [49]:
df['A'].fillna(value=df['A'].median())#median

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [50]:
df['A'].fillna(value=df['A'].mode())#mode

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [51]:
df['A'].fillna(value=df['A'].mean(),inplace=True)

/var/folders/ng/6hr92t6j3pvbp9h3swyww2l00000gn/T/ipykernel_9992/1576873578.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(value=df['A'].mean(),inplace=True)

In [52]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [53]:
df.fillna(value=df.mean(),inplace=True)

In [54]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

### PANDAS GROUPBY

In [55]:
#create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]}

In [56]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [57]:
df=pd.DataFrame(data)

In [58]:
#create dataframe
dat = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
        'Sales':[120,340,124,243,350]}#dataframe will give error bcz of this

In [59]:
#df=pd.DataFrame(dat) #error

In [60]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [61]:
df.groupby('Company')

In [62]:
by_comp=df.groupby('Company')
by_comp #then use aggregate

In [63]:
by_comp.mean()#check error, is TypeError, can't get mean of object

TypeError: agg function failed [how->mean,dtype->object]

In [ ]:
df.dtypes #imp

In [ ]:
by_comp.mean(numeric_only=True) #to remove previous error

In [ ]:
by_comp

In [ ]:
by_comp['Sales']

In [ ]:
by_comp[['Sales']]

In [ ]:
by_comp['Sales'].mean()

In [ ]:
by_comp[['Sales']].mean() #output is dataframe

In [ ]:
by_comp.std

In [ ]:
by_comp.std(numeric_only=True)

In [ ]:
by_comp['Sales'].std()

In [ ]:
by_comp[['Sales']].std()

In [ ]:
by_comp[['Sales']].min()

In [ ]:
by_comp[['Sales','Person']].min()

In [ ]:
by_comp[['Sales','Person']].max()

In [ ]:
by_comp[['Sales']].max()

In [ ]:
df.loc[by_comp['Sales'].idxmax()]

In [ ]:
by_comp.count() #counts number of records

In [ ]:
df.count()

In [ ]:
by_comp.describe()#gives statistical description of all numerical columns inside a dataframe

In [ ]:
df.describe()

In [ ]:
by_comp.describe().transpose()

In [ ]:
by_comp.describe().transpose()['GOOG']

In [ ]:
by_comp.describe().transpose()[['GOOG']]

3/11/25

## OPERATIONS

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10,11],'col2':[444,555,666,444,333,777,111,222,888,999,333],'col3':['abc','def','ghi','xyz','asx','wes','ert','uyuu','kik','dfg','tyg']})

In [ ]:
df

In [ ]:
df.head() #this operation is for printing the top 5 values of your dataframe.

In [ ]:
df.tail() #this operation is for printing the bottom 5 values of your dataframe.

In [ ]:
df.head(3)

In [ ]:
df.tail(2)

## INFO ON UNIQUE VALUES

In [ ]:
df['col2'].unique() #printed set of all unique values present in df

In [ ]:
df['col1'].unique()

In [ ]:
df['col3'].unique()

In [ ]:
df['col2'].nunique() #helps in counting number of unique values in dataframe

In [ ]:
df['col2'].value_counts

## SELECTING DATA

In [ ]:
newdf = df['col1']>2 #applying conditions here

In [ ]:
newdf

In [ ]:
newdf = df['col2']==444 #will return true for all values it satisfies the condition of

In [ ]:
newdf

In [ ]:
newdf = df[(df['col1']>2) & (df['col2']==444)] #combining both using and operator

In [ ]:
newdf

## APPLYING FUNCTIONS

In [ ]:
def times2(x):
    return x*2

In [ ]:
df['col1'].apply(times2) #we use apply to assign columns to others and apply method fns
#pick col of df and apply it to times

In [ ]:
df['col3'].apply(len) #prints length of each string present in col3

In [ ]:
df['col1'].sum()

In [ ]:
df['col3'].sum()

In [ ]:
df['col3'].apply(sum)

### permanent column

In [ ]:
del df['col1']

In [ ]:
df

 column gets deleted this way, not row, we need loc for that, other options for deletion include inplace for col

#### Get col and index names

In [ ]:
df.columns

In [ ]:
df.index

In [ ]:
print(df.columns)

### Sorting and ordering a dataframe

In [ ]:
#def=ascending
df

In [ ]:
df.sort_values(by='col2') #inplace is False by default

In [ ]:
df

### Find null values or check for null values

In [ ]:
df.isnull()

In [ ]:
df.dropna()

In [ ]:
# we need is null sum
df.isnull().sum()

In [ ]:
df['col2']/df['col2'].sum() * 100 #percen

In [ ]:
df = pd.DataFrame({'col1':[1,2,3,4,5,6,7,8,9,10,11],'col2':[444,np.nan,666,444,333,777,111,222,888,999,333],'col3':['abc','def','ghi','xyz','asx','wes','ert','uyuu','kik','dfg','tyg']})

In [ ]:
df['col2']/df['col2'].sum() * 100 #percentage

In [ ]:
#removing missing value 
#col2.mean
df.fillna("Removed nan")

In [ ]:
df

In [ ]:
df.fillna(df['col2'].mean())# we use mean to give value

In [ ]:
df

In [ ]:
df.fillna(df['col2'].mean(),inplace=True)

In [ ]:
df

10/11/25

### MERGING JOINING CONCATENATION

3 main ways of combining data frames together.

In [1]:
#by default it is row wise, specify axis for column wise
import pandas as pd

In [2]:
df1=pd.DataFrame({'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']},index=[0,1,2,3])

In [3]:
df2=pd.DataFrame({'A':['A4','A5','A6','A7'],'B':['B4','B5','B6','B7'],'C':['C4','C5','C6','C7'],'D':['D4','D5','D6','D7']},index=[4,5,6,7])

In [4]:
df3=pd.DataFrame({'A':['A8','A9','A10','A11'],'B':['B8','B9','B10','B11'],'C':['C8','C9','C10','C11'],'D':['D8','D9','D10','D11']},index=[8,9,10,11])

In [5]:
#for concatenation dimensions should match along ax,s, pass list of df.
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [6]:
pd.concat([df1,df2,df3],axis=1)#matrix created by column addition, index no match, value missing, nan

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [ ]:
#if index for all had been 1,2,3,4 then it would have worked without nan

#### Merging

In [7]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [8]:
right=pd.DataFrame({'key':['K0','K1','K2','K3'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [9]:
#merge allows you to merge 2 df using similar logic to sql, at least 2 df reqd. type of join specified

In [10]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [11]:
pd.merge(left,right,how='outer',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [12]:
pd.merge(right,left,how='inner',on='key')

  key   C   D   A   B
0  K0  C0  D0  A0  B0
1  K1  C1  D1  A1  B1
2  K2  C2  D2  A2  B2
3  K3  C3  D3  A3  B3

In [13]:
pd.merge(right,left,how='outer',on='key')

  key   C   D   A   B
0  K0  C0  D0  A0  B0
1  K1  C1  D1  A1  B1
2  K2  C2  D2  A2  B2
3  K3  C3  D3  A3  B3

In [14]:
left=pd.DataFrame({'key1':['K0','K1','K2','K3'],'key2':['K0','K1','K0','K1'],'A':['A0','A1','A2','A3'],'B':['B0','B1','B2','B3']})
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K0  A2  B2
3   K3   K1  A3  B3

In [15]:
right=pd.DataFrame({'key1':['K0','K1','K2','K3'],'key2':['K0','K0','K0','K0'],'C':['C0','C1','C2','C3'],'D':['D0','D1','D2','D3']})
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K2   K0  C2  D2
3   K3   K0  C3  D3

In [16]:
pd.merge(left,right,on=['key1','key2'],how="inner")

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

In [17]:
pd.merge(left,right,on=['key1','key2'],how="outer")

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K0  NaN  NaN   C1   D1
2   K1   K1   A1   B1  NaN  NaN
3   K2   K0   A2   B2   C2   D2
4   K3   K0  NaN  NaN   C3   D3
5   K3   K1   A3   B3  NaN  NaN

In [18]:
pd.merge(left,right,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K2   K0  A2  B2  C2  D2

In [19]:
#where keys dont match, values dont merge

In [20]:
pd.merge(left,right,on=['key1','key2'],how="right")

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0  NaN  NaN  C1  D1
2   K2   K0   A2   B2  C2  D2
3   K3   K0  NaN  NaN  C3  D3

#### Joining

TYPICALLY WE WILL JUST BE EITHER READING CSV FILES DIRECTLY OR USING PANDAS DATAREADER OR QUANDL.

## DATA INPUT AND OUTPUT

In [1]:
import pandas as pd
import numpy as np

In [2]:
df1=pd.read_csv("/Users/chaitalisingh/Downloads/banklist.csv")
df1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
...,...,...,...,...,...,...,...
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05

In [3]:
df1.to_csv('example',index=False)

In [4]:
#for excel, sheetname if multiple sheets,or file
#to excel
#explore similar for excel
#and html

In [5]:
df1

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
...,...,...,...,...,...,...,...
546,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB",27-Jul-01,19-Aug-14
547,Malta National Bank,Malta,OH,6629,North Valley Bank,3-May-01,18-Nov-02
548,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,2-Feb-01,18-Feb-03
549,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,14-Dec-00,17-Mar-05
550,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,13-Oct-00,17-Mar-05